package models

var ErrCode = map[int]string{
	200: "Success",
	401: "未登陆",

	10001: "非法请求",
	10010: "非法参数",

	20001: "用户不存在",
	20002: "用户名或密码错误",
	20010: "登录失败",
	20020: "修改密码错误",
	20030: "用户已存在或空",
	20031: "用户创建失败",
	20032: "用户更新失败",
	20033: "用户删除失败",
	20034: "更新用户状态失败",

	20040: "角色创建失败",
	20041: "角色ID为空",
	20042: "角色修改失败",
	20043: "角色删除失败",
	20050: "权限修改失败",

	30000: "获取密钥失败",
	30002: "创建私钥失败",
	30003: "创建公钥失败",
	30004: "创建密钥失败",

	30020: "创建APPID失败",

	40000: "获取通知地址失败",
	40010: "创建通知地址失败",
	40011: "通知地址删除失败",
	40012: "更新通知地址失败",

	50000: "获取充值订单失败",

	60000: "获取提现订单失败",
	60010: "更新提现订单失败",

	70000: "代币地址为空",
	70010: "获取代币信息失败",
	70011: "创建代币失败",
	70020: "代币UUID为空",
	70021: "代币更新失败",

	70400: "TokenID 为空",
	70401: "TokenID 已存在",
	70500: "获取NFT信息失败",
	70501: "对端服务器访问失败",
	70502: "NFT创建失败",
	70503: "NFT修改失败",
	70504: "对端数据出错",
	70600: "ERC721合约创建失败",

	80000: "获取收款地址失败",
	80010: "创建收款地址失败",
	80011: "收款地址删除失败",
	80020: "没有新地址",
	80021: "更新收款地址失败",

	90000: "合约更新失败",
}
